Repository: KrullBorg/libgdaex
Catalog: po/*.po
Languages: it

source: Datasource cannot be empty.
it: Datasource non può essere vuota.

source: Unable to create GdaEx object.
it: Impossibile creare l'oggetto GdaEx.

source: Error creating database connection: %s
it: Errore nella creazione della connessione al database: %s

source: no details
it: nessun dettaglio

source: cnc_string must not be empty.
it: cnc_string non può essere vuota.

source: no details.
it: nessun dettaglio.

source: Error on writing on log file: %s
it: Errore nella scrittura del file di registro: %s

source: Error on opening log file: %s
it: Errore nell'apertura del file di registro: %s

source: Unable to get the GdaSqlStatement from the GdaStatement.
it: Impossibile ottenere il GdaSqlStatement dal GdaStatement.

source: Statement type %s not implemented.
it: Tipo di istruzione %s non implementato.

source: Error parsing query string: %s %s
it: Errore nell'analisi della stringa della query: %s %s

source: Error executing selection query: %s %s
it: Errore nell'esecuzione della query di selezione: %s %s

source: Selection query executed: %s
it: Query di selezione eseguita: %s

source: No column found with name «%s».
it: Nessuna colonna trovata con il nome «%s».

source: Error on retrieving field's value: «%s». %s
it: Errore nell'ottenere il valore del campo: «%s» %s

source: Error on retrieving field's value: «%s». Unknown GValue type.
it: Errore nell'ottenere il valore del campo: «%s». Tipo GValue sconosciuto.

source: Error on retrieving field's value: «%s».
it: Errore nell'ottenere il valore del campo: «%s».

source: Error on retrieving field's value: unknown GValue type.
it: Impossibile ottenere il valore del campo: tipo GValue sconosciuto.

source: Error on retrieving column %d: %s
it: Errore nell'ottenere la colonna %d: %s

source: Invalid GdaDataModel.
it: GdaDataModel non valido.

source: Unable to create the GtkTreeModel.
it: Impossibile creare il GtkTreeModel.

source: Error opening transaction: %s
it: Errore nell'apertura della transazione: %s

source: No transaction opened
it: Nessuna transazione aperta

source: Transaction opened.
it: Transazione aperta.

source: REMAINS: %s from %s
it: RIMANE: %s da %s

source: Error parsing sql: %s %s
it: Errore nell'analisi dell'sql: %s %s

source: Error executing command query: %s %s
it: Errore nell'esecuzione della query di comando: %s %s

source: Query executed: %s
it: Query eseguita: %s

source: No transaction opened.
it: Nessuna transazione aperta.

source: Error committing transaction: %s
it: Errore nel committare la transazione: %s

source: Transaction committed.
it: Transazione committata.

source: Error rollbacking transaction: %s
it: Errore nel rollbacking della transazione: %s

source: Transaction rolled back.
it: Transazione rolled back.

source: HashTable fields cannot be empty.
it: I campi della HashTable non possono essere vuoti.

source: Unable to get a GdaStatement from GdaSqlBuilder: %s
it: Impossibile ottenere il GdaStatement dal GdaSqlBuilder: %s

source: Unable to get an SQL statement from GdaStatement: %s
it: Impossibile ottenere una istruzione SQL dal GdaStatement: %s

source: Error on creating regex: %s
it: Errore nella creazione dell'espressione regolare: %s

source: Error on regex replacing: %s
it: Errore nell'espressione regolare di sostituzione: %s

source: Unable to load module of myself
it: Impossibile caricare me stesso come modulo

source: Unable to load %s: %s.
it: Impossibile caricare %s: %s.

source: Unable to open modules dir: %s.
it: Impossibile la directosy dei moduli: %s.

source: Modules not supported by this operating system.
it: Moduli non supportati in questo sistema operativo.

source: Error on gui initialization: %s.
it: Errore nell'inizializzazione dell'interfaccia grafica: %s.

source: Table «%s» doesn't exists.
it: La tabella «%s» non esiste.

source: No field added: the field must have a name.
it: Nessun campo aggiunto: il campo deve avere un nome.

source: Relation not created: no field added to the relation.
it: Relazione non creata: nesuun campo aggiunto alla relazione.

source: No table's definitions on xml file.
it: Nessuna definizione di tabella nel file xml.

source: Unknown iwidget_from type «%s».
it: Tipo iwidget_from «%s» sconosciuto.

source: Unknown iwidget_to type «%s».
it: Tipo iwidget_to «%s» sconosciuto.

source: No field's definitions on xml file.
it: Nessuna definizione di campo nel file xml.

source: Where type «%d» not valid.
it: Tipo where «%d» non valido.

source: Unable to create GdaSqlBuilder condition.
it: Impossibile creare la condizione GdaSqlBuilder.

source: Unable to create GdaStatement: %s.
it: Impossibile creare l'oggetto GdaStatement: %s.

source: Unable to create sql: %s.
it: Impossibile creare l'sql: %s.

source: Link type «%d» not valid.
it: Tipo collegamento «%d» non valido.

source: Table «%s» not found.
it: Tabella «%s» non trovata.

source: Field «%s» not found in table «%s».
it: Campo «%s» non trovato nella tabella «%s».

source: DESC
it: DISC

source: Are you sure you want to remove the selected field?
it: Eliminare il campo selezionato?

source: You must select a field before.
it: Occorre prima selezione un campo.

source: Equal
it: uguale a

source: Starts with
it: inizia per

source: Contains
it: contiene

source: Ends with
it: finisce con

source: Case-insensitive starts with
it: inizia per (no maiuscole/minuscole)

source: Case-insensitive contains
it: contiene (no maiuscole/minuscole)

source: Case-insensitive ends with
it: finisce con (no maiuscole/minuscole)

source: Greater
it: maggiore di

source: Greater or equal
it: maggiore di o uguale a

source: Lesser
it: minore di

source: Lesser or equal
it: minore di o uguale a

source: Between
it: compreso tra

source: Is NULL
it: è NULL

source: And
it: e

source: Or
it: o

source: You must select a link's type before.
it: Occorre selezionare prima un tipo di collegamento.

source: You must select a condition's type before.
it: Occorre selezionare prima un tipo di condizione.

source: Link
it: Collegamento

source: Not
it: Non

source: Condition
it: Condizione

source: Value
it: Valore

source: and
it: e

source: Field's type «%d» not valid.
it: Il tipo campo «%d» non è valido.

source: Ascending
it: ascendente

source: Descending
it: discendente

source: True
it: Vero

source: False
it: Falso

source: Fields
it: Campi

source: Field
it: Campo

source: Show
it: Mostra

source: From
it: Da

source: To
it: A

source: Add gr_oup
it: Aggiungi gr_uppo

source: Where
it: Condizioni

source: Order
it: Ordinamento
